Feature: Вход в системата


  Scenario: Вход в системата с валидни данни
    Given Потребителя отваря формата за вход в системата
    And Въвежда валидно потребителско име
    And Въвежда валидна парола
    When Натиска върху бутона за вход в системата
    Then Вижда съобщение: "OK"

  Scenario: Вход в системата без парола
    Given Потребителя отваря формата за вход в системата
    And Въвежда валидно потребителско име
    When Натиска върху бутона за вход в системата
    Then Вижда съобщение: "404"
    
  Scenario: Вход в системата без име
    Given Потребителя отваря формата за вход в системата
    And Въвежда валидна парола
    When Натиска върху бутона за вход в системата
    Then Вижда съобщение: "404"
    
  Scenario: Вход в системата без име и парола
    Given Потребителя отваря формата за вход в системата
    When Натиска върху бутона за вход в системата
    Then Вижда съобщение: "404"


 